package proba.practic.dzStJava9;

public class dz1 {
    //При помощи цикла for вывести на экран нечетные числа от 1 до 99.
    public static void main(String[] args) {
        int i = 1;
        int n;
       // for (i = 1; i <= 99; i++) {
       //     System.out.println(i);
       // }

        //Дано число n при помощи цикла for посчитать факториал n!
       for ( n = i * 5; n <= 120; i++) {
           System.out.println(n);
       }
    }
}
